In [1]:
import pandas as pd

In [2]:
path_csv = './dataset/StockData.csv'
data_csv = pd.read_csv(path_csv)

In [3]:
data_csv['price'].mean()

73.05702966640192

In [4]:
data_csv['price'].median()

69.08500000000001

In [5]:
data_csv['price'].mode()

0    74.59
Name: price, dtype: float64

In [6]:
#to access the first mode 
data_csv['price'].mode()[0]

74.59

In [9]:
data_csv.groupby(['stock'])['price'].mean()

stock
AAPL    109.066698
SNI      71.319206
TJX      66.743566
ZTS      45.098648
Name: price, dtype: float64

In [10]:
# similarly we can get the median price of each stock
data_csv.groupby(['stock'])['price'].median()

stock
AAPL    109.01
SNI      72.31
TJX      68.85
ZTS      45.62
Name: price, dtype: float64

In [11]:
# function to increase the price of the stock by 10%
def profit(s):
    return s + s*0.10 # increase of 10%

In [12]:
data_csv['price'].apply(profit)

0       74.63962
1       75.41754
2       73.52708
3       73.38716
4       73.32116
          ...
5031    85.60200
5032    84.45800
5033    81.21300
5034    80.59700
5035    81.24600
Name: price, Length: 5036, dtype: float64

In [13]:
data_csv['new_price'] = data_csv['price'].apply(profit)
data_csv.head()

  stock        date    price  new_price
0  AAPL  08-02-2013  67.8542   74.63962
1  AAPL  11-02-2013  68.5614   75.41754
2  AAPL  12-02-2013  66.8428   73.52708
3  AAPL  13-02-2013  66.7156   73.38716
4  AAPL  14-02-2013  66.6556   73.32116

In [15]:
data_csv.sort_values(by='new_price',ascending=False) # by default ascending is set to True

     stock        date   price  new_price
1244  AAPL  18-01-2018  179.26    197.186
1243  AAPL  17-01-2018  179.10    197.010
1245  AAPL  19-01-2018  178.46    196.306
1241  AAPL  12-01-2018  177.09    194.799
1247  AAPL  23-01-2018  177.04    194.744
...    ...         ...     ...        ...
4076   ZTS  17-04-2014   28.60     31.460
4074   ZTS  15-04-2014   28.55     31.405
4075   ZTS  16-04-2014   28.53     31.383
4073   ZTS  14-04-2014   28.48     31.328
4072   ZTS  11-04-2014   28.40     31.240

[5036 rows x 4 columns]